<!DOCTYPE html>
<html lang="ko">
<head>
    <meta charset="UTF-8">
    <title>김상윤 지원서</title>
</head>
<body>
    <h1>닷넷 지원서</h1>
    
    <h2>숙지 사항</h2>
    <ul>
        <li>자유롭게 HTML을 꾸며주세요.</li>
        <li>유니코드를 준수해주세요.</li>
        <li>코드를 깔끔하고 일관적이도록 유지해주세요.</li>
    </ul>
    
    <h2>인적 사항</h2>
    <table>
        <tbody>
            <tr>
                <td>이름</td>
                <td>김상윤</td>
            </tr>
            <tr>
                <td>기수</td>
                <td>24기</td>
            </tr>
            <tr>
                <td>학번</td>
                <td>191021</td>
            </tr>
            <tr>
                <td>Gmail</td>
                <td>richard13431343@gmail.com</td>
            </tr>
        </tbody>
    </table>
    
    <h2>닷넷에 지원해주신 이유는 무엇입니까?</h2>
    <p>민사고에 들어오기 전부터 코딩에 관심이 있던 사람으로서 저는 학교에 들어와서 동아리들에 대한 정보들을 다 접했을 때 닷넷 만큼은 꼭 들어가고 싶다고 생각했습니다. 물론 제가 지금까지 코딩에 대하여 배운 부분 중 HTML이 차지하는 양은 비교적 적지만 동아리에 들어가기 위해서라면 스스로라도 배우기로 다짐했었습니다. 이외에도 닷넷에 대해 처음 받은 인상 역시 저에게 지원할 용기를 준 듯 합니다. 처음 학교에 와서 2월달에 KMLA.online에 접속했을 때는 비교적 오류가 자주 일어났던 것으로 기억합니다. 그리고 이에 대하여 화를 내거나 짜증내는 친구들도 있었음에도 불구하고 사과하며 공지하고, 최대한 빠르게, 언제 일어난 듯 문제를 해결하는 닷넷의 모습이 그저 멋있어 보였습니다. 물론 제가 닷넷에 들어간다고 이런 사람이 될 수 있는 것은 아니겠지만 그래도 이와 같은 선배들 밑에서 배우고, 언젠가는 이런 사람이 될 수도 있겠다는 생각이 저를 지원하게 만들었습니다.</p>
    
    <h2 >당신은 얼마나 컴퓨터와 친한가요? (학교 수업, 개인적인 경험, 등으로 접한 사례)</h2>
    <p>제일 처음에 컴퓨터를 만났을 때는 그저 제가 게임을 할 수 있게 해주는 도구로만 본 듯 합니다. 그러나 중학생이었을 때, 처음으로 'Unity'라는 프로그램을 통해 직접 게임을 만들게 되면서 게임 자체보다는 그것을 만드는 데에 더욱 빠져든 것 같습니다. 당시에 제가 가장 푹 빠져 있을 때는 추석 때 지방 가는 열차에서 프로젝트를 시작해 추석 연휴동안 계속하여 다시 집으로 돌아가는 기차에서 끝냈던 기억도 있습니다. 그 때 C#을 배운 뒤로 C,HTML,Python을 배우며 코딩을 점차 배우게 되었습니다. 이외에도 영상 편집, 사진 보정, 전자 악기를 연주하기 위해 컴퓨터를 쓰게 되면서 컴퓨터를 더욱 자주 쓰게 된 것 같습니다. 하지만 민족사관고등학교에 들어오고 나서부터는 시간 관리를 잘 못해서인지 이 모든 활동을 주기적으로 하지는 못하게 되었습니다. 그래도 너무 스트레스 받았거나 시간이 남을 때면 컴퓨터를 통해 제가 하고 싶은 활동들을 다시 하기도 합니다.</p>
    
    <div><pre class="line-numbers"><code class="language-javascript">console.log(&quot;Good Luck!&quot;);</code></pre></div> 
</body>
</html>